---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.CannotRemoveSubordFromGroup
source: html/c0966b3e-74ff-e0aa-712e-933fe5ead279.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.CannotRemoveSubordFromGroup Property

Element can't be removed or excluded from the Group because it is required by another Group element.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotRemoveSubordFromGroup { get; }
```